; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p10---int100n150-m25---int100c150---s185---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 level127 level128 level129 - fuellevel
)

(:init
(sum level0 level7 level7)
(sum level0 level11 level11)
(sum level0 level12 level12)
(sum level0 level13 level13)
(sum level0 level15 level15)
(sum level0 level25 level25)
(sum level1 level7 level8)
(sum level1 level11 level12)
(sum level1 level12 level13)
(sum level1 level13 level14)
(sum level1 level15 level16)
(sum level1 level25 level26)
(sum level2 level7 level9)
(sum level2 level11 level13)
(sum level2 level12 level14)
(sum level2 level13 level15)
(sum level2 level15 level17)
(sum level2 level25 level27)
(sum level3 level7 level10)
(sum level3 level11 level14)
(sum level3 level12 level15)
(sum level3 level13 level16)
(sum level3 level15 level18)
(sum level3 level25 level28)
(sum level4 level7 level11)
(sum level4 level11 level15)
(sum level4 level12 level16)
(sum level4 level13 level17)
(sum level4 level15 level19)
(sum level4 level25 level29)
(sum level5 level7 level12)
(sum level5 level11 level16)
(sum level5 level12 level17)
(sum level5 level13 level18)
(sum level5 level15 level20)
(sum level5 level25 level30)
(sum level6 level7 level13)
(sum level6 level11 level17)
(sum level6 level12 level18)
(sum level6 level13 level19)
(sum level6 level15 level21)
(sum level6 level25 level31)
(sum level7 level7 level14)
(sum level7 level11 level18)
(sum level7 level12 level19)
(sum level7 level13 level20)
(sum level7 level15 level22)
(sum level7 level25 level32)
(sum level8 level7 level15)
(sum level8 level11 level19)
(sum level8 level12 level20)
(sum level8 level13 level21)
(sum level8 level15 level23)
(sum level8 level25 level33)
(sum level9 level7 level16)
(sum level9 level11 level20)
(sum level9 level12 level21)
(sum level9 level13 level22)
(sum level9 level15 level24)
(sum level9 level25 level34)
(sum level10 level7 level17)
(sum level10 level11 level21)
(sum level10 level12 level22)
(sum level10 level13 level23)
(sum level10 level15 level25)
(sum level10 level25 level35)
(sum level11 level7 level18)
(sum level11 level11 level22)
(sum level11 level12 level23)
(sum level11 level13 level24)
(sum level11 level15 level26)
(sum level11 level25 level36)
(sum level12 level7 level19)
(sum level12 level11 level23)
(sum level12 level12 level24)
(sum level12 level13 level25)
(sum level12 level15 level27)
(sum level12 level25 level37)
(sum level13 level7 level20)
(sum level13 level11 level24)
(sum level13 level12 level25)
(sum level13 level13 level26)
(sum level13 level15 level28)
(sum level13 level25 level38)
(sum level14 level7 level21)
(sum level14 level11 level25)
(sum level14 level12 level26)
(sum level14 level13 level27)
(sum level14 level15 level29)
(sum level14 level25 level39)
(sum level15 level7 level22)
(sum level15 level11 level26)
(sum level15 level12 level27)
(sum level15 level13 level28)
(sum level15 level15 level30)
(sum level15 level25 level40)
(sum level16 level7 level23)
(sum level16 level11 level27)
(sum level16 level12 level28)
(sum level16 level13 level29)
(sum level16 level15 level31)
(sum level16 level25 level41)
(sum level17 level7 level24)
(sum level17 level11 level28)
(sum level17 level12 level29)
(sum level17 level13 level30)
(sum level17 level15 level32)
(sum level17 level25 level42)
(sum level18 level7 level25)
(sum level18 level11 level29)
(sum level18 level12 level30)
(sum level18 level13 level31)
(sum level18 level15 level33)
(sum level18 level25 level43)
(sum level19 level7 level26)
(sum level19 level11 level30)
(sum level19 level12 level31)
(sum level19 level13 level32)
(sum level19 level15 level34)
(sum level19 level25 level44)
(sum level20 level7 level27)
(sum level20 level11 level31)
(sum level20 level12 level32)
(sum level20 level13 level33)
(sum level20 level15 level35)
(sum level20 level25 level45)
(sum level21 level7 level28)
(sum level21 level11 level32)
(sum level21 level12 level33)
(sum level21 level13 level34)
(sum level21 level15 level36)
(sum level21 level25 level46)
(sum level22 level7 level29)
(sum level22 level11 level33)
(sum level22 level12 level34)
(sum level22 level13 level35)
(sum level22 level15 level37)
(sum level22 level25 level47)
(sum level23 level7 level30)
(sum level23 level11 level34)
(sum level23 level12 level35)
(sum level23 level13 level36)
(sum level23 level15 level38)
(sum level23 level25 level48)
(sum level24 level7 level31)
(sum level24 level11 level35)
(sum level24 level12 level36)
(sum level24 level13 level37)
(sum level24 level15 level39)
(sum level24 level25 level49)
(sum level25 level7 level32)
(sum level25 level11 level36)
(sum level25 level12 level37)
(sum level25 level13 level38)
(sum level25 level15 level40)
(sum level25 level25 level50)
(sum level26 level7 level33)
(sum level26 level11 level37)
(sum level26 level12 level38)
(sum level26 level13 level39)
(sum level26 level15 level41)
(sum level26 level25 level51)
(sum level27 level7 level34)
(sum level27 level11 level38)
(sum level27 level12 level39)
(sum level27 level13 level40)
(sum level27 level15 level42)
(sum level27 level25 level52)
(sum level28 level7 level35)
(sum level28 level11 level39)
(sum level28 level12 level40)
(sum level28 level13 level41)
(sum level28 level15 level43)
(sum level28 level25 level53)
(sum level29 level7 level36)
(sum level29 level11 level40)
(sum level29 level12 level41)
(sum level29 level13 level42)
(sum level29 level15 level44)
(sum level29 level25 level54)
(sum level30 level7 level37)
(sum level30 level11 level41)
(sum level30 level12 level42)
(sum level30 level13 level43)
(sum level30 level15 level45)
(sum level30 level25 level55)
(sum level31 level7 level38)
(sum level31 level11 level42)
(sum level31 level12 level43)
(sum level31 level13 level44)
(sum level31 level15 level46)
(sum level31 level25 level56)
(sum level32 level7 level39)
(sum level32 level11 level43)
(sum level32 level12 level44)
(sum level32 level13 level45)
(sum level32 level15 level47)
(sum level32 level25 level57)
(sum level33 level7 level40)
(sum level33 level11 level44)
(sum level33 level12 level45)
(sum level33 level13 level46)
(sum level33 level15 level48)
(sum level33 level25 level58)
(sum level34 level7 level41)
(sum level34 level11 level45)
(sum level34 level12 level46)
(sum level34 level13 level47)
(sum level34 level15 level49)
(sum level34 level25 level59)
(sum level35 level7 level42)
(sum level35 level11 level46)
(sum level35 level12 level47)
(sum level35 level13 level48)
(sum level35 level15 level50)
(sum level35 level25 level60)
(sum level36 level7 level43)
(sum level36 level11 level47)
(sum level36 level12 level48)
(sum level36 level13 level49)
(sum level36 level15 level51)
(sum level36 level25 level61)
(sum level37 level7 level44)
(sum level37 level11 level48)
(sum level37 level12 level49)
(sum level37 level13 level50)
(sum level37 level15 level52)
(sum level37 level25 level62)
(sum level38 level7 level45)
(sum level38 level11 level49)
(sum level38 level12 level50)
(sum level38 level13 level51)
(sum level38 level15 level53)
(sum level38 level25 level63)
(sum level39 level7 level46)
(sum level39 level11 level50)
(sum level39 level12 level51)
(sum level39 level13 level52)
(sum level39 level15 level54)
(sum level39 level25 level64)
(sum level40 level7 level47)
(sum level40 level11 level51)
(sum level40 level12 level52)
(sum level40 level13 level53)
(sum level40 level15 level55)
(sum level40 level25 level65)
(sum level41 level7 level48)
(sum level41 level11 level52)
(sum level41 level12 level53)
(sum level41 level13 level54)
(sum level41 level15 level56)
(sum level41 level25 level66)
(sum level42 level7 level49)
(sum level42 level11 level53)
(sum level42 level12 level54)
(sum level42 level13 level55)
(sum level42 level15 level57)
(sum level42 level25 level67)
(sum level43 level7 level50)
(sum level43 level11 level54)
(sum level43 level12 level55)
(sum level43 level13 level56)
(sum level43 level15 level58)
(sum level43 level25 level68)
(sum level44 level7 level51)
(sum level44 level11 level55)
(sum level44 level12 level56)
(sum level44 level13 level57)
(sum level44 level15 level59)
(sum level44 level25 level69)
(sum level45 level7 level52)
(sum level45 level11 level56)
(sum level45 level12 level57)
(sum level45 level13 level58)
(sum level45 level15 level60)
(sum level45 level25 level70)
(sum level46 level7 level53)
(sum level46 level11 level57)
(sum level46 level12 level58)
(sum level46 level13 level59)
(sum level46 level15 level61)
(sum level46 level25 level71)
(sum level47 level7 level54)
(sum level47 level11 level58)
(sum level47 level12 level59)
(sum level47 level13 level60)
(sum level47 level15 level62)
(sum level47 level25 level72)
(sum level48 level7 level55)
(sum level48 level11 level59)
(sum level48 level12 level60)
(sum level48 level13 level61)
(sum level48 level15 level63)
(sum level48 level25 level73)
(sum level49 level7 level56)
(sum level49 level11 level60)
(sum level49 level12 level61)
(sum level49 level13 level62)
(sum level49 level15 level64)
(sum level49 level25 level74)
(sum level50 level7 level57)
(sum level50 level11 level61)
(sum level50 level12 level62)
(sum level50 level13 level63)
(sum level50 level15 level65)
(sum level50 level25 level75)
(sum level51 level7 level58)
(sum level51 level11 level62)
(sum level51 level12 level63)
(sum level51 level13 level64)
(sum level51 level15 level66)
(sum level51 level25 level76)
(sum level52 level7 level59)
(sum level52 level11 level63)
(sum level52 level12 level64)
(sum level52 level13 level65)
(sum level52 level15 level67)
(sum level52 level25 level77)
(sum level53 level7 level60)
(sum level53 level11 level64)
(sum level53 level12 level65)
(sum level53 level13 level66)
(sum level53 level15 level68)
(sum level53 level25 level78)
(sum level54 level7 level61)
(sum level54 level11 level65)
(sum level54 level12 level66)
(sum level54 level13 level67)
(sum level54 level15 level69)
(sum level54 level25 level79)
(sum level55 level7 level62)
(sum level55 level11 level66)
(sum level55 level12 level67)
(sum level55 level13 level68)
(sum level55 level15 level70)
(sum level55 level25 level80)
(sum level56 level7 level63)
(sum level56 level11 level67)
(sum level56 level12 level68)
(sum level56 level13 level69)
(sum level56 level15 level71)
(sum level56 level25 level81)
(sum level57 level7 level64)
(sum level57 level11 level68)
(sum level57 level12 level69)
(sum level57 level13 level70)
(sum level57 level15 level72)
(sum level57 level25 level82)
(sum level58 level7 level65)
(sum level58 level11 level69)
(sum level58 level12 level70)
(sum level58 level13 level71)
(sum level58 level15 level73)
(sum level58 level25 level83)
(sum level59 level7 level66)
(sum level59 level11 level70)
(sum level59 level12 level71)
(sum level59 level13 level72)
(sum level59 level15 level74)
(sum level59 level25 level84)
(sum level60 level7 level67)
(sum level60 level11 level71)
(sum level60 level12 level72)
(sum level60 level13 level73)
(sum level60 level15 level75)
(sum level60 level25 level85)
(sum level61 level7 level68)
(sum level61 level11 level72)
(sum level61 level12 level73)
(sum level61 level13 level74)
(sum level61 level15 level76)
(sum level61 level25 level86)
(sum level62 level7 level69)
(sum level62 level11 level73)
(sum level62 level12 level74)
(sum level62 level13 level75)
(sum level62 level15 level77)
(sum level62 level25 level87)
(sum level63 level7 level70)
(sum level63 level11 level74)
(sum level63 level12 level75)
(sum level63 level13 level76)
(sum level63 level15 level78)
(sum level63 level25 level88)
(sum level64 level7 level71)
(sum level64 level11 level75)
(sum level64 level12 level76)
(sum level64 level13 level77)
(sum level64 level15 level79)
(sum level64 level25 level89)
(sum level65 level7 level72)
(sum level65 level11 level76)
(sum level65 level12 level77)
(sum level65 level13 level78)
(sum level65 level15 level80)
(sum level65 level25 level90)
(sum level66 level7 level73)
(sum level66 level11 level77)
(sum level66 level12 level78)
(sum level66 level13 level79)
(sum level66 level15 level81)
(sum level66 level25 level91)
(sum level67 level7 level74)
(sum level67 level11 level78)
(sum level67 level12 level79)
(sum level67 level13 level80)
(sum level67 level15 level82)
(sum level67 level25 level92)
(sum level68 level7 level75)
(sum level68 level11 level79)
(sum level68 level12 level80)
(sum level68 level13 level81)
(sum level68 level15 level83)
(sum level68 level25 level93)
(sum level69 level7 level76)
(sum level69 level11 level80)
(sum level69 level12 level81)
(sum level69 level13 level82)
(sum level69 level15 level84)
(sum level69 level25 level94)
(sum level70 level7 level77)
(sum level70 level11 level81)
(sum level70 level12 level82)
(sum level70 level13 level83)
(sum level70 level15 level85)
(sum level70 level25 level95)
(sum level71 level7 level78)
(sum level71 level11 level82)
(sum level71 level12 level83)
(sum level71 level13 level84)
(sum level71 level15 level86)
(sum level71 level25 level96)
(sum level72 level7 level79)
(sum level72 level11 level83)
(sum level72 level12 level84)
(sum level72 level13 level85)
(sum level72 level15 level87)
(sum level72 level25 level97)
(sum level73 level7 level80)
(sum level73 level11 level84)
(sum level73 level12 level85)
(sum level73 level13 level86)
(sum level73 level15 level88)
(sum level73 level25 level98)
(sum level74 level7 level81)
(sum level74 level11 level85)
(sum level74 level12 level86)
(sum level74 level13 level87)
(sum level74 level15 level89)
(sum level74 level25 level99)
(sum level75 level7 level82)
(sum level75 level11 level86)
(sum level75 level12 level87)
(sum level75 level13 level88)
(sum level75 level15 level90)
(sum level75 level25 level100)
(sum level76 level7 level83)
(sum level76 level11 level87)
(sum level76 level12 level88)
(sum level76 level13 level89)
(sum level76 level15 level91)
(sum level76 level25 level101)
(sum level77 level7 level84)
(sum level77 level11 level88)
(sum level77 level12 level89)
(sum level77 level13 level90)
(sum level77 level15 level92)
(sum level77 level25 level102)
(sum level78 level7 level85)
(sum level78 level11 level89)
(sum level78 level12 level90)
(sum level78 level13 level91)
(sum level78 level15 level93)
(sum level78 level25 level103)
(sum level79 level7 level86)
(sum level79 level11 level90)
(sum level79 level12 level91)
(sum level79 level13 level92)
(sum level79 level15 level94)
(sum level79 level25 level104)
(sum level80 level7 level87)
(sum level80 level11 level91)
(sum level80 level12 level92)
(sum level80 level13 level93)
(sum level80 level15 level95)
(sum level80 level25 level105)
(sum level81 level7 level88)
(sum level81 level11 level92)
(sum level81 level12 level93)
(sum level81 level13 level94)
(sum level81 level15 level96)
(sum level81 level25 level106)
(sum level82 level7 level89)
(sum level82 level11 level93)
(sum level82 level12 level94)
(sum level82 level13 level95)
(sum level82 level15 level97)
(sum level82 level25 level107)
(sum level83 level7 level90)
(sum level83 level11 level94)
(sum level83 level12 level95)
(sum level83 level13 level96)
(sum level83 level15 level98)
(sum level83 level25 level108)
(sum level84 level7 level91)
(sum level84 level11 level95)
(sum level84 level12 level96)
(sum level84 level13 level97)
(sum level84 level15 level99)
(sum level84 level25 level109)
(sum level85 level7 level92)
(sum level85 level11 level96)
(sum level85 level12 level97)
(sum level85 level13 level98)
(sum level85 level15 level100)
(sum level85 level25 level110)
(sum level86 level7 level93)
(sum level86 level11 level97)
(sum level86 level12 level98)
(sum level86 level13 level99)
(sum level86 level15 level101)
(sum level86 level25 level111)
(sum level87 level7 level94)
(sum level87 level11 level98)
(sum level87 level12 level99)
(sum level87 level13 level100)
(sum level87 level15 level102)
(sum level87 level25 level112)
(sum level88 level7 level95)
(sum level88 level11 level99)
(sum level88 level12 level100)
(sum level88 level13 level101)
(sum level88 level15 level103)
(sum level88 level25 level113)
(sum level89 level7 level96)
(sum level89 level11 level100)
(sum level89 level12 level101)
(sum level89 level13 level102)
(sum level89 level15 level104)
(sum level89 level25 level114)
(sum level90 level7 level97)
(sum level90 level11 level101)
(sum level90 level12 level102)
(sum level90 level13 level103)
(sum level90 level15 level105)
(sum level90 level25 level115)
(sum level91 level7 level98)
(sum level91 level11 level102)
(sum level91 level12 level103)
(sum level91 level13 level104)
(sum level91 level15 level106)
(sum level91 level25 level116)
(sum level92 level7 level99)
(sum level92 level11 level103)
(sum level92 level12 level104)
(sum level92 level13 level105)
(sum level92 level15 level107)
(sum level92 level25 level117)
(sum level93 level7 level100)
(sum level93 level11 level104)
(sum level93 level12 level105)
(sum level93 level13 level106)
(sum level93 level15 level108)
(sum level93 level25 level118)
(sum level94 level7 level101)
(sum level94 level11 level105)
(sum level94 level12 level106)
(sum level94 level13 level107)
(sum level94 level15 level109)
(sum level94 level25 level119)
(sum level95 level7 level102)
(sum level95 level11 level106)
(sum level95 level12 level107)
(sum level95 level13 level108)
(sum level95 level15 level110)
(sum level95 level25 level120)
(sum level96 level7 level103)
(sum level96 level11 level107)
(sum level96 level12 level108)
(sum level96 level13 level109)
(sum level96 level15 level111)
(sum level96 level25 level121)
(sum level97 level7 level104)
(sum level97 level11 level108)
(sum level97 level12 level109)
(sum level97 level13 level110)
(sum level97 level15 level112)
(sum level97 level25 level122)
(sum level98 level7 level105)
(sum level98 level11 level109)
(sum level98 level12 level110)
(sum level98 level13 level111)
(sum level98 level15 level113)
(sum level98 level25 level123)
(sum level99 level7 level106)
(sum level99 level11 level110)
(sum level99 level12 level111)
(sum level99 level13 level112)
(sum level99 level15 level114)
(sum level99 level25 level124)
(sum level100 level7 level107)
(sum level100 level11 level111)
(sum level100 level12 level112)
(sum level100 level13 level113)
(sum level100 level15 level115)
(sum level100 level25 level125)
(sum level101 level7 level108)
(sum level101 level11 level112)
(sum level101 level12 level113)
(sum level101 level13 level114)
(sum level101 level15 level116)
(sum level101 level25 level126)
(sum level102 level7 level109)
(sum level102 level11 level113)
(sum level102 level12 level114)
(sum level102 level13 level115)
(sum level102 level15 level117)
(sum level102 level25 level127)
(sum level103 level7 level110)
(sum level103 level11 level114)
(sum level103 level12 level115)
(sum level103 level13 level116)
(sum level103 level15 level118)
(sum level103 level25 level128)
(sum level104 level7 level111)
(sum level104 level11 level115)
(sum level104 level12 level116)
(sum level104 level13 level117)
(sum level104 level15 level119)
(sum level104 level25 level129)
(sum level105 level7 level112)
(sum level105 level11 level116)
(sum level105 level12 level117)
(sum level105 level13 level118)
(sum level105 level15 level120)
(sum level106 level7 level113)
(sum level106 level11 level117)
(sum level106 level12 level118)
(sum level106 level13 level119)
(sum level106 level15 level121)
(sum level107 level7 level114)
(sum level107 level11 level118)
(sum level107 level12 level119)
(sum level107 level13 level120)
(sum level107 level15 level122)
(sum level108 level7 level115)
(sum level108 level11 level119)
(sum level108 level12 level120)
(sum level108 level13 level121)
(sum level108 level15 level123)
(sum level109 level7 level116)
(sum level109 level11 level120)
(sum level109 level12 level121)
(sum level109 level13 level122)
(sum level109 level15 level124)
(sum level110 level7 level117)
(sum level110 level11 level121)
(sum level110 level12 level122)
(sum level110 level13 level123)
(sum level110 level15 level125)
(sum level111 level7 level118)
(sum level111 level11 level122)
(sum level111 level12 level123)
(sum level111 level13 level124)
(sum level111 level15 level126)
(sum level112 level7 level119)
(sum level112 level11 level123)
(sum level112 level12 level124)
(sum level112 level13 level125)
(sum level112 level15 level127)
(sum level113 level7 level120)
(sum level113 level11 level124)
(sum level113 level12 level125)
(sum level113 level13 level126)
(sum level113 level15 level128)
(sum level114 level7 level121)
(sum level114 level11 level125)
(sum level114 level12 level126)
(sum level114 level13 level127)
(sum level114 level15 level129)
(sum level115 level7 level122)
(sum level115 level11 level126)
(sum level115 level12 level127)
(sum level115 level13 level128)
(sum level116 level7 level123)
(sum level116 level11 level127)
(sum level116 level12 level128)
(sum level116 level13 level129)
(sum level117 level7 level124)
(sum level117 level11 level128)
(sum level117 level12 level129)
(sum level118 level7 level125)
(sum level118 level11 level129)
(sum level119 level7 level126)
(sum level120 level7 level127)
(sum level121 level7 level128)
(sum level122 level7 level129)

(connected l0 l1)
(fuelcost level15 l0 l1)
(connected l1 l0)
(fuelcost level15 l1 l0)
(connected l1 l2)
(fuelcost level13 l1 l2)
(connected l1 l3)
(fuelcost level12 l1 l3)
(connected l1 l4)
(fuelcost level7 l1 l4)
(connected l2 l1)
(fuelcost level13 l2 l1)
(connected l2 l3)
(fuelcost level11 l2 l3)
(connected l2 l4)
(fuelcost level25 l2 l4)
(connected l3 l1)
(fuelcost level12 l3 l1)
(connected l3 l2)
(fuelcost level11 l3 l2)
(connected l3 l4)
(fuelcost level7 l3 l4)
(connected l4 l1)
(fuelcost level7 l4 l1)
(connected l4 l2)
(fuelcost level25 l4 l2)
(connected l4 l3)
(fuelcost level7 l4 l3)

(at t0 l4)
(fuel t0 level129)
(= (total-cost) 0)

(at p0 l0)
(at p1 l0)
(at p2 l4)
(at p3 l4)
(at p4 l2)
(at p5 l3)
(at p6 l2)
(at p7 l2)
(at p8 l2)
(at p9 l4)
)

(:goal
(and
(at p0 l2)
(at p1 l2)
(at p2 l1)
(at p3 l0)
(at p4 l0)
(at p5 l1)
(at p6 l3)
(at p7 l4)
(at p8 l1)
(at p9 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l4 l2 level104 level25 level129)
   deleted: (at t0 l4) (fuel t0 level129)
   added: (at t0 l2) (fuel t0 level104)
   goals met: 0 of 10
2. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 0 of 10
3. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 0 of 10
4. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 0 of 10
5. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 10
6. (drive t0 l2 l4 level79 level25 level104)
   deleted: (at t0 l2) (fuel t0 level104)
   added: (at t0 l4) (fuel t0 level79)
   goals met: 0 of 10
7. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 1 of 10
8. (load p9 t0 l4)
   deleted: (at p9 l4)
   added: (in p9 t0)
   goals met: 1 of 10
9. (load p3 t0 l4)
   deleted: (at p3 l4)
   added: (in p3 t0)
   goals met: 1 of 10
10. (load p2 t0 l4)
   deleted: (at p2 l4)
   added: (in p2 t0)
   goals met: 1 of 10
11. (drive t0 l4 l3 level72 level7 level79)
   deleted: (at t0 l4) (fuel t0 level79)
   added: (at t0 l3) (fuel t0 level72)
   goals met: 1 of 10
12. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 2 of 10
13. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 2 of 10
14. (drive t0 l3 l1 level60 level12 level72)
   deleted: (at t0 l3) (fuel t0 level72)
   added: (at t0 l1) (fuel t0 level60)
   goals met: 2 of 10
15. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 3 of 10
16. (drive t0 l1 l0 level45 level15 level60)
   deleted: (at t0 l1) (fuel t0 level60)
   added: (at t0 l0) (fuel t0 level45)
   goals met: 3 of 10
17. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 3 of 10
18. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 3 of 10
19. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 4 of 10
20. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 5 of 10
21. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 6 of 10
22. (drive t0 l0 l1 level30 level15 level45)
   deleted: (at t0 l0) (fuel t0 level45)
   added: (at t0 l1) (fuel t0 level30)
   goals met: 6 of 10
23. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 7 of 10
24. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 8 of 10
25. (drive t0 l1 l2 level17 level13 level30)
   deleted: (at t0 l1) (fuel t0 level30)
   added: (at t0 l2) (fuel t0 level17)
   goals met: 8 of 10
26. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 9 of 10
27. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 10 of 10
